%练习3第10题
clc;clear all;
%按照表3.7输入数据 将曲线分为上下两部分
x1 = [0 3 5 7 9 11 12 13 14 15];
x2 = [15 14 13 12 11 9 7 5 3 0];
y1 = [0 1.8 2.2 2.7 3.0 3.1 2.9 2.5 2.0 1.6];
y2 = [1.6 1.0 1.2 1.8 2.0 2.1 2.0 1.7 1.2 0];

%第一部分y1
%按0.1的间隔在x1方向产生插值点
u1 = 0:0.1:15;
%在y1方向产生拉格朗日插值
v1 = lagr(x1, y1, u1);
%在y1方向产生分段线性插值
v2 = interp1(x1, y1, u1);
%在y1方向产生三次样条插值
v3 = spline(x1, y1, u1);

%第一部分y2
%按0.1的间隔在x2方向产生插值点
u2 = 15:-0.1:0;
%在y2方向产生拉格朗日插值
v4 = lagr(x2, y2, u2);
%在y2方向产生分段线性插值
v5 = interp1(x2, y2, u2);
%在y2方向产生三次样条插值
v6 = spline(x2, y2, u2);

subplot(2,2,1),plot(x1, y1, x2, y2),axis([0 15 0 4]) 
gtext('原轮廓线','FontSize',12)
subplot(2,2,2),plot(u1, v1, u2, v4),axis([0 15 -20 4])      
gtext('拉格朗日插值','FontSize',12)
subplot(2,2,3),plot(u1, v2, u2, v5),axis([0 15 0 4])      
gtext('分段线性插值','FontSize',12)
subplot(2,2,4),plot(u1, v3, u2, v6),axis([0 15 0 4])
gtext('三次样条插值','FontSize',12)

%梯形公式计算数值积分
disp('原轮廓面积：');
trapz([x1 x2], [y1 y2])
disp('拉格朗日插值面积：');
trapz([u1 u2], [v1 v4])
disp('分段线性插值面积：');
trapz([u1 u2], [v2 v5])
disp('三次样条插值面积：');
trapz([u1 u2], [v3 v6])
